docs/modules/completion/freemacs-completion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en_US" xml:lang="en_US">
  <head>
    <!-- 2022-07-21 Thu 18:55 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>Completion Configuration</title>
    <meta name="author" content="Thomas Freeman" />
    <meta name="keywords" content="Emacs" />
    <meta name="generator" content="Org Mode" />
    <link
      rel="stylesheet"
      type="text/css"
      href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"
    />
    <link
      rel="stylesheet"
      type="text/css"
      href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"
    />
  </head>
  <body>
    <div id="org-div-home-and-up">
      <a accesskey="h" href="../../init.html"> UP </a>
      |
      <a accesskey="H" href="../../index.html"> HOME </a>
    </div>
    <div id="content" class="content">
      <h1 class="title">Completion Configuration</h1>
      <div id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li>
              <a href="#org5182289">Cape</a>
              <ul>
                <li>
                  <ul>
                    <li><a href="#org8d7cae3">Cape Completion Functions</a></li>
                  </ul>
                </li>
              </ul>
            </li>
            <li>
              <a href="#org11b503d">Consult</a>
              <ul>
                <li>
                  <a href="#org274d50b">Change Register Preview to Consult</a>
                </li>
                <li><a href="#org788ff41">Consult Notes</a></li>
                <li><a href="#org9357956">Consult YASnippet</a></li>
                <li><a href="#org9bc41d5">Consult Flycheck</a></li>
                <li>
                  <a href="#org7bd8fce">Set Root Function for Projects</a>
                </li>
                <li><a href="#org215dd40">Set the Narrowing Key</a></li>
                <li><a href="#org5a4263a">Tweak Register Preview Window</a></li>
                <li>
                  <a href="#org0b8dc12">Use Consult to Select xref Locations</a>
                </li>
                <li><a href="#org3a6fc9e">Completion Cycling</a></li>
                <li><a href="#orge57e699">Completion by Pressing Tab</a></li>
              </ul>
            </li>
            <li>
              <a href="#org27e8106">Corfu</a>
              <ul>
                <li>
                  <a href="#org8289af0">Use TAB for Selecting Candidates</a>
                </li>
                <li><a href="#org0593e14">Corfu-doc</a></li>
              </ul>
            </li>
            <li>
              <a href="#org40239f8">Embark</a>
              <ul>
                <li><a href="#orgedff872">Embark Mode Line</a></li>
                <li>
                  <a href="#org279a8a0">Embark Integration with Consult</a>
                </li>
              </ul>
            </li>
            <li><a href="#org09e475e">Orderless</a></li>
            <li><a href="#org1e1c1de">Marginalia</a></li>
            <li><a href="#org93834ae">Vertico</a></li>
            <li><a href="#org249a05f">Kind Icon</a></li>
            <li><a href="#org1b74d96">End</a></li>
          </ul>
        </div>
      </div>
      <hr />

      <p>
        This section contains configuration to set up completion tools in Emacs.
      </p>

      <div id="outline-container-org5182289" class="outline-2">
        <h2 id="org5182289">Cape</h2>
        <div class="outline-text-2" id="text-org5182289">
          <p>
            <a href="https://github.com/minad/cape">Cape</a> (completion at
            point extensions) provides some extensions to make autocompletion
            better and plays well with Corfu.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
              id="org1f3711b"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">cape</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:bind</span> <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p p"</span> . completion-at-point<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p t"</span> . complete-tag<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p d"</span> . cape-dabbrev<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p f"</span> . cape-file<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p k"</span> . cape-keyword<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p s"</span> . cape-symbol<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p a"</span> . cape-abbrev<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p \\"</span> . cape-tex<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p _"</span> . cape-tex<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c p ^"</span> . cape-tex<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span>add-to-list 'completion-at-point-functions #'cape-file<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-to-list 'completion-at-point-functions #'cape-tex<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-to-list 'completion-at-point-functions #'cape-dabbrev<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-to-list 'completion-at-point-functions #'cape-keyword<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-to-list 'completion-at-point-functions #'cape-symbol<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>

        <div id="outline-container-org8d7cae3" class="outline-4">
          <h4 id="org8d7cae3">Cape Completion Functions</h4>
          <div class="outline-text-4" id="text-org8d7cae3">
            <p>
              Cape provides a number of
              <code>completion-at-point</code> functions that can be used. Below
              are the functions that I use that have not been intrusive.
            </p>

            <p>The following will complete file names in buffers:</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>add-to-list 'completion-at-point-functions #'cape-file<span style="color: #1ea8fc;">)</span>
</pre>
            </div>

            <p>This will complete items in TeX and LaTeX modes:</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>add-to-list 'completion-at-point-functions #'cape-tex<span style="color: #1ea8fc;">)</span>
</pre>
            </div>

            <p>Search other buffers for completion candidates:</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>add-to-list 'completion-at-point-functions #'cape-dabbrev<span style="color: #1ea8fc;">)</span>
</pre>
            </div>

            <p>Complete keywords in programming modes:</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>add-to-list 'completion-at-point-functions #'cape-keyword<span style="color: #1ea8fc;">)</span>
</pre>
            </div>

            <p>Complete Emacs-lisp symbols:</p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>add-to-list 'completion-at-point-functions #'cape-symbol<span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>
      </div>
