modules/completion/freemacs-completion.org
* Consult

[[https://github.com/minad/consult][Consult]] provides a number of highly useful commands. The complete list of commands can be found [[https://github.com/minad/consult#available-commands][here]].

#+begin_src emacs-lisp :tangle yes :noweb yes
  (use-package consult
    :straight t
    :bind (("C-c h" . consult-history)
           ("C-c m" . consult-mode-command)
           ("C-c k" . consult-kmacro)
           ("C-x M-:" . consult-complex-command)
           ("C-x b" . consult-buffer)
           ("C-x 4 b" . consult-buffer-other-window)
           ("C-x 5 b" . consult-buffer-other-frame)
           ("C-x r b" . consult-bookmark)
           ("M-#" . consult-register-load)
           ("M-'" . consult-register-store)
           ("C-M-#" . consult-register)
           ("M-y" . consult-yank-pop)
           ("<help> a" . consult-apropos)
           ("M-g e" . consult-compile-error)
           ("M-g f" . consult-flymake)
           ("M-g g" . consult-goto-line)
           ("M-g M-g" . consult-goto-line)
           ("M-g o" . consult-outline)
           ("M-g m" . consult-mark)
           ("M-g k" . consult-global-mark)
           ("M-g i" . consult-imenu)
           ("M-g I" . consult-imenu-multi)
           ("M-s d" . consult-find)
           ("M-s D" . consult-locate)
           ("M-s g" . consult-grep)
           ("M-s G" . consult-git-grep)
           ("M-s r" . consult-ripgrep)
           ("M-s l" . consult-line)
           ("M-s L" . consult-line-multi)
           ("M-s m" . consult-multi-occur)
           ("M-s k" . consult-keep-lines)
           ("M-s u" . consult-focus-lines)
           ("M-s e" . consult-isearch-history)
           :map isearch-mode-map
           ("M-e" . consult-isearch-history)
           ("M-s e" . consult-isearch-history)
           ("M-s l" . consult-line)
           ("M-s L" . consult-line-multi))
    :config
    <<consult_config>>)
#+end_src

** Change Register Preview to Consult

Change the default Emacs ~register-preview-function~ to use consult effectively.

#+begin_src emacs-lisp :noweb-ref emacs_custom
  (register-preview-function #'consult-register-format)
#+end_src

** Consult Notes

With Consult Notes, users can use Consult to search through note directories specified by the ~consult-notes-sources~ list. Consult will then let you search through these notes with completion frameworks and has good integration with Org Roam.

#+begin_src emacs-lisp :tangle yes
  (use-package consult-notes
    :straight (:type git :host github :repo "mclear-tools/consult-notes")
    :after consult
    :custom
    (consult-notes-sources '(("GTD"  ?g  "~/Dropbox/gtd/")
                                    ("Org Roam"  ?r  "~/Dropbox/org-roam/")))
    :commands (consult-notes
               consult-notes-search-all
               consult-notes-org-roam-find-node
               consult-notes-org-roam-find-node-relation)
    :config
    (consult-notes-org-roam-mode))
#+end_src

** Consult YASnippet

If you have a tendency to forget about all of those YASnippet template abbrevs, then Consult YASnippet can be used to search though your YASnippet templates using a completion framework.

#+begin_src emacs-lisp :tangle yes
  (use-package consult-yasnippet
    :straight t
    :after (consult yasnippet)
    :commands (consult-yasnippet))
#+end_src

