docs/modules/completion/freemacs-completion.html

      <div id="outline-container-org11b503d" class="outline-2">
        <h2 id="org11b503d">Consult</h2>
        <div class="outline-text-2" id="text-org11b503d">
          <p>
            <a href="https://github.com/minad/consult">Consult</a> provides a
            number of highly useful commands. The complete list of commands can
            be found
            <a href="https://github.com/minad/consult#available-commands"
              >here</a
            >.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">consult</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:bind</span> <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c h"</span> . consult-history<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c m"</span> . consult-mode-command<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-c k"</span> . consult-kmacro<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x M-:"</span> . consult-complex-command<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x b"</span> . consult-buffer<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x 4 b"</span> . consult-buffer-other-window<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x 5 b"</span> . consult-buffer-other-frame<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-x r b"</span> . consult-bookmark<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-#"</span> . consult-register-load<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-'"</span> . consult-register-store<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"C-M-#"</span> . consult-register<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-y"</span> . consult-yank-pop<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"&lt;help&gt; a"</span> . consult-apropos<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g e"</span> . consult-compile-error<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g f"</span> . consult-flymake<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g g"</span> . consult-goto-line<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g M-g"</span> . consult-goto-line<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g o"</span> . consult-outline<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g m"</span> . consult-mark<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g k"</span> . consult-global-mark<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g i"</span> . consult-imenu<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-g I"</span> . consult-imenu-multi<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s d"</span> . consult-find<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s D"</span> . consult-locate<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s g"</span> . consult-grep<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s G"</span> . consult-git-grep<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s r"</span> . consult-ripgrep<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s l"</span> . consult-line<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s L"</span> . consult-line-multi<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s m"</span> . consult-multi-occur<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s k"</span> . consult-keep-lines<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s u"</span> . consult-focus-lines<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s e"</span> . consult-isearch-history<span style="color: #a7da1e;">)</span>
         <span style="color: #1ea8fc;">:map</span> isearch-mode-map
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-e"</span> . consult-isearch-history<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s e"</span> . consult-isearch-history<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s l"</span> . consult-line<span style="color: #a7da1e;">)</span>
         <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"M-s L"</span> . consult-line-multi<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> consult-project-root-function
        <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">lambda</span> <span style="color: #df85ff;">()</span>
          <span style="color: #df85ff;">(</span><span style="color: #ff2afc; font-weight: bold;">when-let</span> <span style="color: #A875FF;">(</span>project <span style="color: #1ea8fc;">(</span>project-current<span style="color: #1ea8fc;">)</span><span style="color: #A875FF;">)</span>
            <span style="color: #A875FF;">(</span>car <span style="color: #1ea8fc;">(</span>project-roots project<span style="color: #1ea8fc;">)</span><span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> consult-narrow-key <span style="color: #7984D1;">"&lt;"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>

        <div id="outline-container-org274d50b" class="outline-3">
          <h3 id="org274d50b">Change Register Preview to Consult</h3>
          <div class="outline-text-3" id="text-org274d50b">
            <p>
              Change the default Emacs <code>register-preview-function</code> to
              use consult effectively.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>register-preview-function #'consult-register-format<span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-org788ff41" class="outline-3">
          <h3 id="org788ff41">Consult Notes</h3>
          <div class="outline-text-3" id="text-org788ff41">
            <p>
              With Consult Notes, users can use Consult to search through note
              directories specified by the
              <code>consult-notes-sources</code> list. Consult will then let you
              search through these notes with completion frameworks and has good
              integration with Org Roam.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">consult-notes</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:type</span> git <span style="color: #1ea8fc;">:host</span> github <span style="color: #1ea8fc;">:repo</span> <span style="color: #7984D1;">"mclear-tools/consult-notes"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:after</span> consult
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>consult-notes-sources '<span style="color: #a7da1e;">(</span><span style="color: #df85ff;">(</span><span style="color: #7984D1;">"GTD"</span>  ?g  <span style="color: #7984D1;">"~/Dropbox/gtd/"</span><span style="color: #df85ff;">)</span>
                                  <span style="color: #df85ff;">(</span><span style="color: #7984D1;">"Org Roam"</span>  ?r  <span style="color: #7984D1;">"~/Dropbox/org-roam/"</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:commands</span> <span style="color: #ff2afc;">(</span>consult-notes
             consult-notes-search-all
             consult-notes-org-roam-find-node
             consult-notes-org-roam-find-node-relation<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>consult-notes-org-roam-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-org9357956" class="outline-3">
          <h3 id="org9357956">Consult YASnippet</h3>
          <div class="outline-text-3" id="text-org9357956">
            <p>
              If you have a tendency to forget about all of those YASnippet
              template abbrevs, then Consult YASnippet can be used to search
              though your YASnippet templates using a completion framework.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">consult-yasnippet</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:after</span> <span style="color: #ff2afc;">(</span>consult yasnippet<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:commands</span> <span style="color: #ff2afc;">(</span>consult-yasnippet<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>
