modules/completion/freemacs-completion.org
** Consult Flycheck

Searching through Flycheck errors is very efficient with Consult Flycheck. It will list all of the errors from the current buffer and these can be searched using a completion framework.

#+begin_src emacs-lisp :tangle yes
  (use-package consult-flycheck
    :straight t
    :commands (consult-flycheck)
    :after (consult flycheck))
#+end_src

** Set Root Function for Projects

Use the built-in project function to find the root of any project. Projectile can also be used but I have yet to compare the differences between the two projects to make a decision as to which one to use.

#+begin_src emacs-lisp :noweb-ref consult_config
  (setq consult-project-root-function
        (lambda ()
          (when-let (project (project-current))
            (car (project-roots project)))))
#+end_src

** Set the Narrowing Key

The narrowing key is pressed before a key used to narrow the results returned from consult. An example would be ~< m~ to list bookmarks after calling ~consult-buffer~.

#+begin_src emacs-lisp :noweb-ref consult_config
  (setq consult-narrow-key "<")
#+end_src

** Tweak Register Preview Window

The following line makes the register preview window look better by adding sorting and thin lines to break up the results into easy to view categories.

#+begin_src emacs-lisp :noweb-ref emacs_config
  (advice-add #'register-preview
              :override #'consult-register-window)
#+end_src

** Use Consult to Select xref Locations

Use Consult to search through and select xref locations in buffers

#+begin_src emacs-lisp :noweb-ref emacs_custom
  (xref-show-xrefs-function #'consult-xref)
  (xref-show-definitions-function #'consult-xref)
#+end_src

** Completion Cycling

Cycle through completion candidates by pressing the completion key.

#+begin_src emacs-lisp :noweb-ref emacs_custom
  (completion-cycle-threshold t)
#+end_src

** Completion by Pressing Tab

~<TAB>~ will indent lines by default. In order to turn ~<TAB>~ into a button that activates autocomplete, the ~tab-always-indent~ variable must be set to ~complete~. This will cause pressing ~<TAB>~ once to indent, and twice will cause it to activate completion.

#+begin_src emacs-lisp :noweb-ref emacs_custom
  (tab-always-indent 'complete)
#+end_src

* Corfu

[[https://github.com/minad/corfu][Corfu]] for in-buffer completion. Corfu will provide an in-buffer popup window that will be populated with various completion options.

#+begin_src emacs-lisp :tangle yes :noweb yes
    (use-package corfu
      :straight (:files (:defaults "extensions/*.el"))
      :init
      (global-corfu-mode)
      (corfu-popupinfo-mode)
      :bind
      <<corfu_bind>>
      :custom
      (corfu-auto t)
      (corfu-cycle t)
      (corfu-preselect-first nil)
      <<tab-selection>>
      :config
      (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)
      (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify))
#+end_src

** Use TAB for Selecting Candidates

Instead of using M-tab which will switch windows in XFCE---my default desktop environment---use TAB to cycle between the different possible options.

#+name: tab-selection
#+begin_src emacs-lisp :noweb-ref corfu_bind
  (:map corfu-map
        ("TAB" . corfu-next)
        ([tab] . corfu-next)
        ("S-TAB" . corfu-previous)
        ([backtab] . corfu-previous))
#+end_src

