docs/modules/completion/freemacs-completion.html

        <div id="outline-container-org9bc41d5" class="outline-3">
          <h3 id="org9bc41d5">Consult Flycheck</h3>
          <div class="outline-text-3" id="text-org9bc41d5">
            <p>
              Searching through Flycheck errors is very efficient with Consult
              Flycheck. It will list all of the errors from the current buffer
              and these can be searched using a completion framework.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">consult-flycheck</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:commands</span> <span style="color: #ff2afc;">(</span>consult-flycheck<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:after</span> <span style="color: #ff2afc;">(</span>consult flycheck<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-org7bd8fce" class="outline-3">
          <h3 id="org7bd8fce">Set Root Function for Projects</h3>
          <div class="outline-text-3" id="text-org7bd8fce">
            <p>
              Use the built-in project function to find the root of any project.
              Projectile can also be used but I have yet to compare the
              differences between the two projects to make a decision as to
              which one to use.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> consult-project-root-function
      <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">lambda</span> <span style="color: #a7da1e;">()</span>
        <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">when-let</span> <span style="color: #df85ff;">(</span>project <span style="color: #A875FF;">(</span>project-current<span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span>
          <span style="color: #df85ff;">(</span>car <span style="color: #A875FF;">(</span>project-roots project<span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-org215dd40" class="outline-3">
          <h3 id="org215dd40">Set the Narrowing Key</h3>
          <div class="outline-text-3" id="text-org215dd40">
            <p>
              The narrowing key is pressed before a key used to narrow the
              results returned from consult. An example would be
              <code>&lt; m</code> to list bookmarks after calling
              <code>consult-buffer</code>.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> consult-narrow-key <span style="color: #7984D1;">"&lt;"</span><span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-org5a4263a" class="outline-3">
          <h3 id="org5a4263a">Tweak Register Preview Window</h3>
          <div class="outline-text-3" id="text-org5a4263a">
            <p>
              The following line makes the register preview window look better
              by adding sorting and thin lines to break up the results into easy
              to view categories.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>advice-add #'register-preview
            <span style="color: #1ea8fc;">:override</span> #'consult-register-window<span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-org0b8dc12" class="outline-3">
          <h3 id="org0b8dc12">Use Consult to Select xref Locations</h3>
          <div class="outline-text-3" id="text-org0b8dc12">
            <p>
              Use Consult to search through and select xref locations in buffers
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>xref-show-xrefs-function #'consult-xref<span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>xref-show-definitions-function #'consult-xref<span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-org3a6fc9e" class="outline-3">
          <h3 id="org3a6fc9e">Completion Cycling</h3>
          <div class="outline-text-3" id="text-org3a6fc9e">
            <p>
              Cycle through completion candidates by pressing the completion
              key.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>completion-cycle-threshold t<span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-orge57e699" class="outline-3">
          <h3 id="orge57e699">Completion by Pressing Tab</h3>
          <div class="outline-text-3" id="text-orge57e699">
            <p>
              <code>&lt;TAB&gt;</code> will indent lines by default. In order to
              turn <code>&lt;TAB&gt;</code> into a button that activates
              autocomplete, the <code>tab-always-indent</code> variable must be
              set to <code>complete</code>. This will cause pressing
              <code>&lt;TAB&gt;</code> once to indent, and twice will cause it
              to activate completion.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
              ><span style="color: #1ea8fc;">(</span>tab-always-indent 'complete<span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>
      </div>

      <div id="outline-container-org27e8106" class="outline-2">
        <h2 id="org27e8106">Corfu</h2>
        <div class="outline-text-2" id="text-org27e8106">
          <p>
            <a href="https://github.com/minad/corfu">Corfu</a> for in-buffer
            completion. Corfu will provide an in-buffer popup window that will
            be populated with various completion options.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-emacs-lisp"
            ><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">corfu</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span>global-corfu-mode<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:bind</span>
  <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:map</span> corfu-map
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"TAB"</span> . corfu-next<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>tab<span style="color: #df85ff;">]</span> . corfu-next<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"S-TAB"</span> . corfu-previous<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>backtab<span style="color: #df85ff;">]</span> . corfu-previous<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span>corfu-auto t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>corfu-cycle t<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>corfu-preselect-first nil<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:map</span> corfu-map
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"TAB"</span> . corfu-next<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>tab<span style="color: #df85ff;">]</span> . corfu-next<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"S-TAB"</span> . corfu-previous<span style="color: #a7da1e;">)</span>
        <span style="color: #a7da1e;">(</span><span style="color: #df85ff;">[</span>backtab<span style="color: #df85ff;">]</span> . corfu-previous<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>advice-add 'pcomplete-completions-at-point <span style="color: #1ea8fc;">:around</span> #'cape-wrap-silent<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>advice-add 'pcomplete-completions-at-point <span style="color: #1ea8fc;">:around</span> #'cape-wrap-purify<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
          </div>
        </div>

        <div id="outline-container-org8289af0" class="outline-3">
          <h3 id="org8289af0">Use TAB for Selecting Candidates</h3>
          <div class="outline-text-3" id="text-org8289af0">
            <p>
              Instead of using M-tab which will switch windows in XFCE&#x2014;my
              default desktop environment&#x2014;use TAB to cycle between the
              different possible options.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-emacs-lisp"
                id="org7eaadcd"
              ><span style="color: #1ea8fc;">(</span><span style="color: #1ea8fc;">:map</span> corfu-map
      <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"TAB"</span> . corfu-next<span style="color: #ff2afc;">)</span>
      <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">[</span>tab<span style="color: #a7da1e;">]</span> . corfu-next<span style="color: #ff2afc;">)</span>
      <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"S-TAB"</span> . corfu-previous<span style="color: #ff2afc;">)</span>
      <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">[</span>backtab<span style="color: #a7da1e;">]</span> . corfu-previous<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
            </div>
          </div>
        </div>
